# Эти задачи необходимо решить используя регулярные выражения!

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь
#  заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре,
#  допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net),
# te_4_st@test.com - верно указан.

import re

name = input('Введите Ваше имя: ')
surname = input('Введите Вашу фамилию: ')
email = input('Введите Ваш электронный адресс: ')

fio_pattern = '^[A-ZA-Я][a-zа-я]+$'
email_pattern = '^[a-z0-9_]+[@][a-z0-9]+\.(com|ru|org)$'

name_search_result = re.search(fio_pattern, name)
surname_search_result = re.search(fio_pattern, surname)
email_search_result = re.search(email_pattern, email)

if name_search_result is None:
    print('Имя неверного формата!')
else:
    print('Имя введено корректно!')

if surname_search_result is None:
    print('Фамилия неверного формата!')
else:
    print('Фамилия введено корректно!')

if email_search_result is None:
    print('E-mail неверного формата!')
else:
    print('E-mail введено корректно!')

# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

import re

pattern = '\.{2,}'

search_result = re.search(pattern, some_str)

if search_result is None:
    print('В тексте нет более 1 точки подряд!')
else:
    print('В тексте есть более 1 точки подряд!')
